# Pandas

In [ ]:
# Dataframe- special object to data in tabular form(rows and column)

In [1]:
import numpy as np
import pandas as pd

In [6]:
# Try to create a data frame
user_data = {
    "MarksA": np.random.randint(1,100,5),
    "MarksB": np.random.randint(50,100,5),
    "MarksC": np.random.randint(1,100,5),
}

In [7]:
user_data

{'MarksA': array([97, 66, 58, 33, 18]),
 'MarksB': array([77, 69, 74, 97, 98]),
 'MarksC': array([15, 29, 94, 37, 55])}

In [11]:
df = pd.DataFrame(user_data,dtype='float32')
print(df)

   MarksA  MarksB  MarksC
0    97.0    77.0    15.0
1    66.0    69.0    29.0
2    58.0    74.0    94.0
3    33.0    97.0    37.0
4    18.0    98.0    55.0

In [12]:
df.head()#default 5 rows , you can give also

   MarksA  MarksB  MarksC
0    97.0    77.0    15.0
1    66.0    69.0    29.0
2    58.0    74.0    94.0
3    33.0    97.0    37.0
4    18.0    98.0    55.0

In [13]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [14]:
df.to_csv('marks.csv')  ##storing data frame as csv in local host

In [19]:
my_data=pd.read_csv('marks.csv')
my_data=my_data.drop(columns=['Unnamed: 0'])
print(my_data)

   MarksA  MarksB  MarksC
0    97.0    77.0    15.0
1    66.0    69.0    29.0
2    58.0    74.0    94.0
3    33.0    97.0    37.0
4    18.0    98.0    55.0

In [20]:
my_data.describe()

         MarksA     MarksB     MarksC
count   5.00000   5.000000   5.000000
mean   54.40000  83.000000  46.000000
std    30.59902  13.546217  30.479501
min    18.00000  69.000000  15.000000
25%    33.00000  74.000000  29.000000
50%    58.00000  77.000000  37.000000
75%    66.00000  97.000000  55.000000
max    97.00000  98.000000  94.000000

In [21]:
my_data.tail(n=3)#last 5 rows default

   MarksA  MarksB  MarksC
2    58.0    74.0    94.0
3    33.0    97.0    37.0
4    18.0    98.0    55.0

In [22]:
# Row
df.iloc[3]

MarksA    33.0
MarksB    97.0
MarksC    37.0
Name: 3, dtype: float32

In [26]:
# Row and column
df.iloc[3,1]

97.0

In [27]:
df.iloc[3][1]

97.0

In [31]:
idx= [df.columns.get_loc('MarksB'),df.columns.get_loc('MarksC')]
print(idx)
df.iloc[3,idx]

[1, 2]

MarksB    97.0
MarksC    37.0
Name: 3, dtype: float32

In [32]:
df.iloc[:3,idx]

   MarksB  MarksC
0    77.0    15.0
1    69.0    29.0
2    74.0    94.0

In [35]:
df.iloc[:3,[1,2]]

   MarksB  MarksC
0    77.0    15.0
1    69.0    29.0
2    74.0    94.0

In [36]:
## sort your data frame
my_data

   MarksA  MarksB  MarksC
0    97.0    77.0    15.0
1    66.0    69.0    29.0
2    58.0    74.0    94.0
3    33.0    97.0    37.0
4    18.0    98.0    55.0

In [42]:
my_data.sort_values(by=["MarksA"],ascending=True)

   MarksA  MarksB  MarksC
4    18.0    98.0    55.0
3    33.0    97.0    37.0
2    58.0    74.0    94.0
1    66.0    69.0    29.0
0    97.0    77.0    15.0

In [39]:
my_data.sort_values(by=["MarksA"],ascending=False)

   MarksA  MarksB  MarksC
0    97.0    77.0    15.0
1    66.0    69.0    29.0
2    58.0    74.0    94.0
3    33.0    97.0    37.0
4    18.0    98.0    55.0

In [43]:
data_array=my_data.values ##converting to numpy array

In [47]:
print(type(my_data))
print(my_data.shape)
print(type(data_array))
print(data_array.shape)

<class 'pandas.core.frame.DataFrame'>
(5, 3)
<class 'numpy.ndarray'>
(5, 3)

In [48]:
data_array[2][2]

94.0

In [50]:
## Numpy arrays back into data frame
new_df=pd.DataFrame(data_array,dtype='int32',columns=["Physics","Chem","Maths"])
new_df.head()

   Physics  Chem  Maths
0       97    77     15
1       66    69     29
2       58    74     94
3       33    97     37
4       18    98     55

In [52]:
new_df.to_csv("PCM.csv",index=False)
pcm=pd.read_csv('PCM.csv')

In [53]:
print(pcm)

   Physics  Chem  Maths
0       97    77     15
1       66    69     29
2       58    74     94
3       33    97     37
4       18    98     55

##Loading & visualising MNIST Dataset using Pandas & Matplotlib

In [2]:
import matplotlib.pyplot as plt
import pandas as pd

In [1]:
pwd

'C:\\Users\\HP'

In [4]:
df = pd.read_csv("...\Users\HP\Downloads\mnist_train.csv")

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 3-4: truncated \UXXXXXXXX escape (<ipython-input-4-97e6ba19c7cf>, line 1)

In [ ]:
df.shape #size dimension
df.head(n=3) #table
print(type(df))
data= df.values #gives numpy array of data
np.random.shuffle(data)#shuffling randomly data araray
print(type(data))

In [ ]:
# y and x values
X = data[ : ,1: ] #shape= (4200,784)
Y = data[ :,0] #shape (4200,)

In [ ]:
## Try to visualize one image
X[0].shape #linear array

In [ ]:
def drawing (X,Y,i):
    plt.imshow(X[i].reshape(28,28),cmap='gray')
    plt.title("Label "+str(Y[i]))
    plt.show()
#first five images of dataset
for i in range(5):
    drawing(X,Y,i)

In [ ]:
## Split this dataset (if dataset is randomly shuffled)
## dataset is splitted into two parts for training and testing
split = int(0.80*X.shape[0])
print(split)

In [ ]:
x_train,y_train = X[ :split, :],Y[:split] #major part 
x_test,y_test = X[split: , :], Y[split: ] #minor part

print(x_train.shape, y_train.shape)

print(x_test.shape, y_train.shape)

In [ ]:
## if dataset is not shuffled, randomise it
## Randomization
import numpy as np
a = np.array([1,2,3,5,6])
np.random.shuffle(a)

print(a)

In [ ]:
# Randomly shuffle  a 2D array
a = np.array([[1,2,3],
             [4,5,6]
             [7,8,9]])
np.random.shuffle(a) ##only rows get shuffled

In [ ]:
# Try to plot a visualisation (Grid of first 26 images 5 X 5)

plt.figure(figsize=(10,10))##resizing figure
for i in range(25):
    plt.subplot(5,5,i+1) 
    plt.imshow(x_train[i].reshape(28,28),cmap='gray')
    plt.title(y_train[i])
    plt.axis("off")

In [ ]:
# If you don't wanna split your model into test and train manually,
# then you can use sklearn inbuilt function train_test_split
# it shuffle every time randomly
from sklearn.model_selection import train_test_split
XT,xt,YT,yt = train_test_split(X,Y,test_size=0.2,random_state=5)
# random_state=n is given to prevent shuffling of array everytime

print(XT.shape,YT.shape)
print(xt.shape,yt.shape)

#shame output as we done earlier manually

# Let's Work on Movie Dataset

In [5]:
# Task : Make a scatter plot between Length of Movie Title (x-axis) and Frequency of occurence of  that length(along Y-axis)

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
df = pd.read_csv("movie_metadata.csv")
df.head()
df.columns

In [ ]:
titles =  df.get('movie_title') # list(df.get('movie_title'))
scores = df.get('imdb_score')
print(title)

In [ ]:
freq_title = {}
for t in title:
    length = len(t)
    try:
        frq_title(length)+=1
    except:
        freq_title(length) = 1
    #print(length)
    #print(t)
print(freq_title)

In [ ]:
X = np.array(list(freq_title.keys()))
Y = np.array(list(freq_title.values()))
plt.scatter(X,Y)
plt.xlabel("Movie title len")
plt.ylabel("No of movies")
plt.show()